PinkFluffyUnic0rn/stm32flight/main.c
/**
* @file main.c
* @brief Main file with entry point
*/

#include <math.h>
#include <string.h>
#include <stdio.h>
#include <stdarg.h>
#include <stdlib.h>
#include <ctype.h>

#include "stm32f4xx_hal.h"

#include "periphconf.h"
#include "settings.h"
#include "dsp.h"
#include "log.h"
#include "crc.h"
#include "runvals.h"
#include "timev.h"
#include "command.h"
#include "config.h"
#include "util.h"

#include "device.h"
#include "icm42688.h"
#include "dps368.h"
#include "esp8266.h"
#include "qmc5883l.h"
#include "crsf.h"
#include "w25.h"
#include "m10.h"
#include "uartconf.h"
#include "irc.h"
#include "dshot.h"

/**
* @brief External interrupt callback. It calls interrupt handlers
	from drivers for devices that use external interrupts.
* @param pin number of pin triggered the callback
* @return none
*/
void HAL_GPIO_EXTI_Callback(uint16_t pin)
{
	if (DEVITENABLED(Dev[DEV_RF].status)) {
		Dev[DEV_RF].interrupt(Dev[DEV_RF].priv, &pin);
	}
}

/**
* @brief UART receive callback. It calls interrupt handlers
	from drivers for devices working through UART.
* @param huart context for UART triggered that callback
* @return none
*/
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	if (DEVITENABLED(Dev[DEV_GNSS].status))
		Dev[DEV_GNSS].interrupt(Dev[DEV_GNSS].priv, huart);

	if (DEVITENABLED(Dev[DEV_CRSF].status))
		Dev[DEV_CRSF].interrupt(Dev[DEV_CRSF].priv, huart);

	if (DEVITENABLED(Dev[DEV_UART].status))
		Dev[DEV_UART].interrupt(Dev[DEV_UART].priv, huart);
}

/**
* @brief UART error callback. Calls UART error handlers
	from drivers for devices working through UART.
* @param huart context for UART triggered that callback.
* @return none
*/
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
	if (DEVITENABLED(Dev[DEV_CRSF].status))
		Dev[DEV_CRSF].error(Dev[DEV_CRSF].priv, huart);
}

void NMI_Handler(void)
{
	TIM1->CCR1 = TIM1->CCR2 = TIM1->CCR3 = TIM1->CCR4 = 0;

	HAL_GPIO_WritePin(ERROR_GPIO, ERROR_PIN, GPIO_PIN_SET);

	while (1) {}
}

void HardFault_Handler(void)
{
	TIM1->CCR1 = TIM1->CCR2 = TIM1->CCR3 = TIM1->CCR4 = 0;

	HAL_GPIO_WritePin(ERROR_GPIO, ERROR_PIN, GPIO_PIN_SET);
	
	while (1) {}
}

void MemManage_Handler(void)
{
	TIM1->CCR1 = TIM1->CCR2 = TIM1->CCR3 = TIM1->CCR4 = 0;
	
	HAL_GPIO_WritePin(ERROR_GPIO, ERROR_PIN, GPIO_PIN_SET);

	while (1) {}
}

void BusFault_Handler(void)
{
	TIM1->CCR1 = TIM1->CCR2 = TIM1->CCR3 = TIM1->CCR4 = 0;
	
	HAL_GPIO_WritePin(ERROR_GPIO, ERROR_PIN, GPIO_PIN_SET);
	
	while (1) {}
}

void UsageFault_Handler(void)
{
	TIM1->CCR1 = TIM1->CCR2 = TIM1->CCR3 = TIM1->CCR4 = 0;
	
	HAL_GPIO_WritePin(ERROR_GPIO, ERROR_PIN, GPIO_PIN_SET);

	while (1) {}
}

void error_handler(void)
{
	TIM1->CCR1 = TIM1->CCR2 = TIM1->CCR3 = TIM1->CCR4 = 0;

	HAL_GPIO_WritePin(ERROR_GPIO, ERROR_PIN, GPIO_PIN_SET);

	__disable_irq();
	while (1) {}
}

/**
* @brief Get battery voltage from ADC.
* @return battery voltage
*/
float batteryvoltage()
{
	ADC_HandleTypeDef *hadc;
	uint32_t v;

	hadc = pconf_batteryhadc;

	HAL_ADC_Start(hadc);
	HAL_ADC_PollForConversion(hadc, 1);

	v = HAL_ADC_GetValue(hadc);

	HAL_ADC_Stop(hadc);

	return (v / (float) 0xfff * BAT_SCALE);
}

/**
* @brief Get ESC current from ADC.
* @return battery current in amperes
*/
float esccurrent()
{
	ADC_HandleTypeDef *hadc;
	uint32_t v;
	
	hadc = pconf_currenthadc;

	HAL_ADC_Start(hadc);
	HAL_ADC_PollForConversion(hadc, 1);

	v = HAL_ADC_GetValue(hadc);

	HAL_ADC_Stop(hadc);

	return (v / (float) 0xfff * St.adj.cursc + St.adj.curroff);
}

/**
* @brief Calculate tilt compensated heading direction
	using magnetometer readings, roll value and pitch value.
* @param r roll value
* @param p pitch value
* @param x magnetometer's X axis value
* @param y magnetometer's Y axis value
* @param z magnetometer's Z axis value
* @return tilt compensated heading
*/
float qmc_heading(float r, float p, float x, float y, float z)
{
	x = x * cosf(p) + y * sinf(r) * sinf(p)
		- z * cosf(r) * sinf(p);
	y = y * cosf(r) + z * sinf(r);

	return circf(atan2f(y, x) + St.adj.magdecl);
}

/**
* @brief Stabilization loop. Callback for TEV_PID periodic event.
	It is the place where is almost all work happening.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int stabilize(int ms)
{
	float ltm, lbm, rbm, rtm;
	float roll, pitch, yaw;
	float rollcor, pitchcor, yawcor, thrustcor;
	float vx, vy, vz;
	float gy, gx, gz;
	float ay, ax, az;
	float va;
	float ht;
	float dt;

	// debug pin switching
	HAL_GPIO_WritePin(debuggpio, debugpin,
		!(HAL_GPIO_ReadPin(debuggpio, debugpin)));

	// emergency disarm happened
	if (Emergencydisarm) {
		setthrust(Dev + DEV_DSHOT, 0.0, 0.0, 0.0, 0.0);
		En = 0.0;
	}

	// get time passed from last invocation of this calback function
	dt = ms / (float) TICKSPERSEC;

	// divide-by-zero protection
	dt = (dt < 0.000001) ? 0.000001 : dt;

	// update battery voltage
	writelog(LOG_BAT, dsp_getlpf(Lpf + LPF_BAT));

	// toggle arming indication led
	HAL_GPIO_WritePin(armgpio, armpin,
		(En > 0.5) ? GPIO_PIN_SET : GPIO_PIN_RESET);

	// get accelerometer and gyroscope readings
	Dev[DEV_IMU].read(Dev[DEV_IMU].priv, &Imudata,
		sizeof(struct icm_data));

	// apply accelerometer offsets
	Imudata.afx += (Imudata.ft - 25.0) * St.adj.acctsc.x;
	Imudata.afy += (Imudata.ft - 25.0) * St.adj.acctsc.y;
	Imudata.afz += (Imudata.ft - 25.0) * St.adj.acctsc.z;
	Imudata.afx -= St.adj.acc0.x;
	Imudata.afy -= St.adj.acc0.y;
	Imudata.afz -= St.adj.acc0.z;

	// apply gyroscope offsets
	Imudata.gfx -= St.adj.gyro0.x;
	Imudata.gfy -= St.adj.gyro0.y;
	Imudata.gfz -= St.adj.gyro0.z;

	// write accelerometer and gyroscope values into log
	writelog(LOG_ACC_X, Imudata.afx);
	writelog(LOG_ACC_Y, Imudata.afy);
	writelog(LOG_ACC_Z, Imudata.afz);
	writelog(LOG_GYRO_X, Imudata.gfx);
	writelog(LOG_GYRO_Y, Imudata.gfy);
	writelog(LOG_GYRO_Z, Imudata.gfz);

	// update accelerometer temperature
	dsp_updatelpf(Lpf + LPF_IMUTEMP, Imudata.ft);

	// apply accelerometer offsets
	ax = dsp_updatelpf(Lpf + LPF_ACCX, Imudata.afx);
	ay = dsp_updatelpf(Lpf + LPF_ACCY, Imudata.afy);
	az = dsp_updatelpf(Lpf + LPF_ACCZ, Imudata.afz);

	// update vertical acceleration low-pass filter
	dsp_updatelpf(Lpf + LPF_THR, Imudata.afz);

	// convert gyroscope values into radians
	gx = deg2rad(dsp_updatelpf(Lpf + LPF_GYROX, Imudata.gfx));
	gy = deg2rad(dsp_updatelpf(Lpf + LPF_GYROY, Imudata.gfy));
	gz = deg2rad(dsp_updatelpf(Lpf + LPF_GYROZ, Imudata.gfz));

	// update complimenraty filter for roll axis and get next roll
	// value. First signal (value) is signal to be integrated: it's
	// the speed of the rotation around Y axis. Second signal is
	// signal to be low-pass filtered: it's the tilt value that is
	// calculated from acceleromer readings through some
	// trigonometry.
	roll = dsp_updatelpf(Lpf + LPF_ROLL,
		dsp_updatecompl(Cmpl + CMPL_ROLL, gy * dt,
			atan2f(-ax, sqrt(ay * ay + az * az)))
				- St.adj.att0.roll);

