PinkFluffyUnic0rn/stm32flight/main.c
	// same as for roll but for different axes
	pitch = dsp_updatelpf(Lpf + LPF_PITCH,
		dsp_updatecompl(Cmpl + CMPL_PITCH, gx * dt,
			atan2f(ay, sqrt(ax * ax + az * az))) 
				- St.adj.att0.pitch);

	// update complimenraty filter for yaw axis and get next yaw
	// value. First signal is the speed of the rotation around Z
	// axis. Second signal is the heading value that is
	// calculated from magnetometer readings.
	yaw = dsp_updatelpf(Lpf + LPF_YAW,
		circf(dsp_updatecirccompl(Cmpl + CMPL_YAW, -gz * dt,
		qmc_heading(roll, -pitch,
			Qmcdata.fx, Qmcdata.fy, Qmcdata.fz)) 
			- St.adj.att0.yaw));

	// calculate gravity direction vector in IMU coordination system
	// using pitch and roll values;
	vx = cos(-pitch) * sin(-roll);
	vy = -sin(-pitch);
	vz = cos(-pitch) * cos(-roll);

	// update vertical acceleration using acceleration
	// vector to gravity vector projection
	va = (vx * ax + vy * ay + vz * az)
		/ sqrtf(vx * vx + vy * vy + vz * vz);

	dsp_updatelpf(Lpf + LPF_VAU, va);
	dsp_updatelpf(Lpf + LPF_VAPT1, va);
	dsp_updatelpf(Lpf + LPF_VAAVG, va);
	
	writelog(LOG_CUSTOM0, dsp_getlpf(Lpf + LPF_VAU));

	// update forward acceleration using acceleration
	// vector to gravity vector projection
	vx = sin(-roll) * sin(-pitch);
	vy = cos(-pitch);
	vz = cos(-roll) * sin(-pitch);

	dsp_updatelpf(Lpf + LPF_FA, (vx * ax + vy * ay + vz * az)
		/ sqrtf(vx * vx + vy * vy + vz * vz));

	// get pitch corrected value of the hover throttle
	ht = St.adj.hoverthrottle / (cosf(-pitch) * cosf(-roll));

	// if vertical acceleration is negative, most likely
	// quadcopter is upside down, perform emergency disarm
	if (dsp_getlpf(Lpf + LPF_THR) < -0.5) {
		Emergencydisarm = 1;
		setthrust(Dev + DEV_DSHOT, 0.0, 0.0, 0.0, 0.0);
		En = 0.0;
	}

	// write roll, pitch and yaw values into log
	writelog(LOG_ROLL, roll);
	writelog(LOG_PITCH, pitch);
	writelog(LOG_YAW, yaw);

	if (Speedpid) {
		// if in single PID loop mode for tilt
		// (called accro mode), use only rotation speed values
		// from the gyroscope. Update speed PID controllers for
		// roll and pitch and get next correction values.
		rollcor = dsp_pidbl(Pid + PID_ROLLS, Rolltarget, gy);
		pitchcor = dsp_pidbl(Pid + PID_PITCHS, Pitchtarget, gx);
	}
	else {
		// if in double loop mode for tilt (most commonly used
		// mode), first update roll and pitch POSITION PID
		// controllers using currect roll and values and targets
		// got from ERLS and get next correction values.
		rollcor = dsp_pidbl(Pid + PID_ROLLP, Rolltarget, roll);
		pitchcor = dsp_pidbl(Pid + PID_PITCHP, Pitchtarget, pitch);

		// then use this values to update roll and pitch speed
		// PID controllers and get next SPEED correction values.
		rollcor = dsp_pidbl(Pid + PID_ROLLS, rollcor, gy);
		pitchcor = dsp_pidbl(Pid + PID_PITCHS, pitchcor, gx);
	}

	if (Yawspeedpid) {
		// if single PID loop mode for yaw is used just use
		// rotation speed values around axis Z to upadte yaw PID
		// controller and get next yaw correciton value
		yawcor = dsp_pidbl(Pid + PID_YAWS, Yawtarget, gz);
	}
	else {
		// if in double loop mode for yaw, first use yaw value
		// calcualted using magnetometer and yaw target got from
		// ELRS remote to update yaw POSITION PID controller and
		// get it's next correciton value.
		yawcor = dsp_pidbl(Pid + PID_YAWP, Yawtarget, yaw);

		// then use this value to update yaw speed PID
		// controller and get next yaw SPEED correction value
		yawcor = dsp_pidbl(Pid + PID_YAWS, yawcor, gz);
	}

	if (Altmode == ALTMODE_POS) {
		// if altitude hold mode enabled, first use altitude
		// got from barometer readings and target altitude from
		// ELRS remote to update altitude PID controller and
		// get it's next correction value
		thrustcor = dsp_pidbl(Pid + PID_ALT, Thrust,
			dsp_getcompl(Cmpl + CMPL_ALT) - Alt0);

		// then use altitude correction value and climb rate
		// calculated by complimentary filter (barometer
		// differentiating and accelerometer Z-axis integration)
		// to update climb rate PID controller and get it's next
		// correction value
		thrustcor = dsp_pidbl(Pid + PID_CLIMBRATE, thrustcor,
			dsp_getcompl(Cmpl + CMPL_CLIMBRATE));
		
		// and next use climb rate correction value to update
		// vertial acceleration PID controller and get next
		// thrust correction value
		thrustcor = dsp_pidbl(Pid + PID_VA, thrustcor + 1.0,
			dsp_getlpf(Lpf + LPF_VAPT1)) + ht;	
	}
	else if (Altmode == ALTMODE_SPEED) {
		// if consttant climb rate mode, first use climb rate
		// calculated by complimentary filter (barometer
		// differentiating and accelerometer Z-axis integration)
		// and target climb rate from ELRS remote to update
		// climb rate PID controller and get it's next
		// correction value
		thrustcor = dsp_pidbl(Pid + PID_CLIMBRATE, Thrust,
			dsp_getcompl(Cmpl + CMPL_CLIMBRATE));	

		// and next use climb rate correction value to update
		// vertial acceleration PID controller and get next
		// thrust correction value
		thrustcor = dsp_pidbl(Pid + PID_VA, thrustcor + 1.0,
			dsp_getlpf(Lpf + LPF_VAPT1)) + ht;	
	}
	else {
		if (Hovermode) {
			// if no altitude hold and hover throttle mode
			// is enabled, update vertical acceleration PID
			// controller using next low-pass filtered
			// value of vertical acceleration and target
			// got from ERLS remote
			thrustcor = dsp_pidbl(Pid + PID_VA,
				Thrust + 1.0,
				dsp_getlpf(Lpf + LPF_VAPT1)) + ht;
		}
		else {
			// if no altitude hold and hover throttle mode
			// is disabled, update thrust PID controller
			// using next low-pass filtered value of thrust
			// and target got from ERLS remote
			thrustcor = dsp_pidbl(Pid + PID_VA,
				Thrust + 1.0,
				dsp_getlpf(Lpf + LPF_THR));
		}
	}

	// reset bilinear PID-controllers when disarmed
	if (En < 0.5) {
		dsp_resetpidbl(Pid + PID_PITCHP);
		dsp_resetpidbl(Pid + PID_ROLLP);
		dsp_resetpidbl(Pid + PID_PITCHS);
		dsp_resetpidbl(Pid + PID_ROLLS);
		dsp_resetpidbl(Pid + PID_YAWP);
		dsp_resetpidbl(Pid + PID_YAWS);
		dsp_resetpidbl(Pid + PID_VA);
		dsp_resetpidbl(Pid + PID_CLIMBRATE);
		dsp_resetpidbl(Pid + PID_ALT);
	}

	// disable I-term for all
	// PID-controller, if no throttle
	if ((Altmode == ALTMODE_ACCEL && Thrust < 0
			&& !Hovermode)
		|| (Altmode == ALTMODE_SPEED
			&& Thrust < -0.95 * St.ctrl.climbratemax)
		|| (Altmode == ALTMODE_POS && Thrust < 0.01)) {
		dsp_resetpidbls(Pid + PID_PITCHP);
		dsp_resetpidbls(Pid + PID_ROLLP);
		dsp_resetpidbls(Pid + PID_PITCHS);
		dsp_resetpidbls(Pid + PID_ROLLS);
		dsp_resetpidbls(Pid + PID_YAWP);
		dsp_resetpidbls(Pid + PID_YAWS);
		dsp_resetpidbls(Pid + PID_VA);
		dsp_resetpidbls(Pid + PID_CLIMBRATE);
		dsp_resetpidbls(Pid + PID_ALT);
	}

	// calculate weights for motors
	// thrust calibration values
	ltm = (1.0 + St.adj.mtrsc.r / 2) * (1.0 + St.adj.mtrsc.p / 2);
	rtm = (1.0 - St.adj.mtrsc.r / 2) * (1.0 + St.adj.mtrsc.p / 2);
	lbm = (1.0 + St.adj.mtrsc.r / 2) * (1.0 - St.adj.mtrsc.p / 2);
	rbm = (1.0 - St.adj.mtrsc.r / 2) * (1.0 - St.adj.mtrsc.p / 2);

