PinkFluffyUnic0rn/stm32flight/main.c
	return 0;
}

/**
* @brief Update battery voltage and current.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int powercheck(int ms)
{
	dsp_updatelpf(Lpf + LPF_BAT, batteryvoltage());
	dsp_updatelpf(Lpf + LPF_CUR, esccurrent());

	return 0;
}

/**
* @brief Move to next point in autopilot track.
* @return always 0
*/
int autopilotstep()
{
	Autopilottimer = 0;
	++Curpoint;

	return 0;
}

/**
* @brief Update control values when moving in autopilot mode.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int autopilotupdate(int ms)
{
	struct trackpoint *nextpoint;
	float dt;

	dt = ms / (float) TICKSPERSEC;
	
	if (!Autopilot || Pointscount == 0 || Curpoint < 0
			|| Curpoint >= Pointscount) {
		return 0;
	}

	nextpoint = Points + Curpoint + 1;
	if (nextpoint->type == AUTOPILOT_START)
		Autopilottimer = 0.0;
	else if (nextpoint->type == AUTOPILOT_TAKEOFF) {
		Thrust = Autopilottimer * nextpoint->takeoff.alt
			/ nextpoint->takeoff.t;
		
		Autopilottimer += dt;

		if (Autopilottimer > nextpoint->takeoff.t)
			autopilotstep();
	}
	else if (nextpoint->type == AUTOPILOT_HOVER) {
		Thrust = nextpoint->hover.alt;
		
		Yawtarget = atan2f(nextpoint->hover.x,
			nextpoint->hover.y);
		
		Autopilottimer += dt;

		if (Autopilottimer > nextpoint->hover.t)
			autopilotstep();
	}
	else if (nextpoint->type == AUTOPILOT_LANDING) {
		if (dsp_getcompl(Cmpl + CMPL_ALT) - Alt0 > 5.0)
			Thrust -= dt;
		else if (dsp_getcompl(Cmpl + CMPL_ALT) - Alt0 > 5.0)
			Thrust -= dt * 0.5;
		else if (dsp_getcompl(Cmpl + CMPL_ALT) - Alt0 > 2.0)
			Thrust -= dt * 0.25;
		else
			Thrust -= dt * 0.125;
		
		if (dsp_getcompl(Cmpl + CMPL_ALT) - Alt0 <= 0.1)
			autopilotstep();
	}
	else if (nextpoint->type == AUTOPILOT_STOP) {
		Thrust = -1.0;
	}
	else if (nextpoint->type == AUTOPILOT_FORWARD) {
/*
		float dx, dy;
	
		Pitchtarget = M_PI / 12.0;
		
		Yawtarget = atan2f(nextpoint->forward.x,
			nextpoint->forward.y);

		dx = nextpoint->forward.x - Points[Curpoint].forward.x;
		dy = nextpoint->forward.y - Points[Curpoint].forward.y;

		if (forwardpath > sqrtf(dx * dx + dy * dy))
*/
		autopilotstep();
	}

	return 0;
}

/**
* @brief Set control values using CRSF packet.
* @param cd -- CRSF packet
* @param ms -- microsecond passed from last CRSF packet
* @return always 0
*/
int crsfcmd(const struct crsf_data *cd, int ms)
{
	static float slottimeout = ELRS_PUSHTIMEOUT;
	float dt;
	int slot;

	// write first 8 channels values into log	
	writelog(LOG_CRSFCH0, cd->chf[ERLS_CH_ROLL]);
	writelog(LOG_CRSFCH1, cd->chf[ERLS_CH_PITCH]);
	writelog(LOG_CRSFCH2, cd->chf[ERLS_CH_THRUST]);
	writelog(LOG_CRSFCH3, cd->chf[ERLS_CH_YAW]);
	writelog(LOG_CRSFCH4, cd->chf[ERLS_CH_YAWMODE]);
	writelog(LOG_CRSFCH5, cd->chf[ERLS_CH_ATTMODE]);
	writelog(LOG_CRSFCH6, cd->chf[ERLS_CH_THRMODE]);
	writelog(LOG_CRSFCH7, cd->chf[ERLS_CH_ONOFF]);

	// ONOFF channel on remote is used to turn on/off
	// erls control. If this channel has low state, all remote
	// commands will be ignored, but packet still continue to
	// comming
	Elrs = (cd->chf[ERLS_CH_ONOFF] > 0.5) ? 1 : 0;

	// update ERLS timeout as we got packet
	Elrstimeout = ELRS_TIMEOUT;

	if (!Elrs) {
		En = 0.0;
		setthrust(Dev + DEV_DSHOT, 0.0, 0.0, 0.0, 0.0);

		return 0;
	}

	// get time passed from last ERLS packet
	dt = ms / (float) TICKSPERSEC;

	// SETSLOT channel is used to select settings slot, it is
	// a 6 position switch on remote used for testing
	if (cd->chf[ERLS_CH_SETSLOT] < -0.8)		slot = 0;
	else if (cd->chf[ERLS_CH_SETSLOT] < -0.4)	slot = 1;
	else if (cd->chf[ERLS_CH_SETSLOT] < 0)		slot = 2;
	else if (cd->chf[ERLS_CH_SETSLOT] < 0.4)	slot = 3;
	else if (cd->chf[ERLS_CH_SETSLOT] < 0.8)	slot = 4;
	else						slot = 5;

	// slot changed differ from current, wait some time to
	// ensure that it's not a some error, if enough time passed,
	// load settings from choosen slot
	if (slot != Curslot) {
		slottimeout -= dt;

		if (slottimeout <= 0.0) {
			readsettings(slot);
			setstabilize(0);

			Curslot = slot;
		}
	} else
		slottimeout = ELRS_PUSHTIMEOUT;

	// AUTOPILOT channel is used to turn on/off autopilot
	// if it is greater than 0, autopilot is on, otherwise
	// it is turned off
	if (cd->chf[ERLS_CH_AUTOPILOT] > 0.0) {
		if (Autopilot == 0)
			Curpoint = 0;

		Autopilot = 1;
	}
	else
		Autopilot = 0;

	// set magnetometer stabilization mode, if YAWMODE channel has
	// value more than 0, set gyroscope only stabilization mode 
	// otherwise
	if (Autopilot) {
	//	Yawtarget = 0.0;
		Yawspeedpid = 0;
	}
	else 
	if (cd->chf[ERLS_CH_YAWMODE] > 0.0) {
		Yawspeedpid = 0;

		// in magnetometer stabilization mode absolute yaw
		// value is stabilized, so target should be integrated
		Yawtarget = circf(Yawtarget
			+ cd->chf[ERLS_CH_YAW] * dt * M_PI
				* St.ctrl.yawrate);
	}
	else {
		Yawspeedpid = 1;
		Yawtarget = -cd->chf[ERLS_CH_YAW]
			* M_PI * St.ctrl.yawrate;
	}

	// set altitude hold mode, if THRMODE channel has value more
	// than 25, set climbrate stabilization mode if THRMODE channel
	// has value between -25 and 25, set vertical acceleration mode
	// if THRMODE channel value is less than -25
	if (Autopilot) {
		Altmode = ALTMODE_POS;
	}
	else if (cd->chf[ERLS_CH_THRMODE] > 0.25) {
		Altmode = ALTMODE_POS;
		Thrust = (cd->chf[ERLS_CH_THRUST] + 1.0)
			/ 2.0 * St.ctrl.altmax;
	}
	else if (cd->chf[ERLS_CH_THRMODE] < -0.25) {
		Altmode = ALTMODE_ACCEL;

		// Set throttle mode usging HOVER channel,
		// if it is less that 0.0, use throttle setpoint
		// range starting slightly less than 0,
		// otherwise use throttle setpoint range with
		// 0 value in middle
		if (cd->chf[ERLS_CH_HOVER] < 0.0) {
			Hovermode = 0;
			Thrust = (cd->chf[ERLS_CH_THRUST] + 0.5)
				/ 1.5 * St.ctrl.accelmax;
		}
		else {
			Hovermode = 1;
			Thrust = (cd->chf[ERLS_CH_THRUST])
				/ 2.0 * St.ctrl.accelmax;
		}

	}
	else {
		Altmode = ALTMODE_SPEED;
		Thrust = cd->chf[ERLS_CH_THRUST] * St.ctrl.climbratemax;
	}

	// if ALTCALIB channel is active (it's no-fix button on remote
	// used for testing), set reference altitude from current
	// altitude
	if (cd->chf[ERLS_CH_ALTCALIB] > 0.0) {
		Alt0 = dsp_getcompl(Cmpl + CMPL_ALT);
		Goffset = 1.0 - dsp_getlpf(Lpf + LPF_VAAVG);
	}

	// set acceleromter stabilization mode, if ATTMODE channel has
	// value more than 25, set gyroscope only stabilization mode, if
	// ATTMODE channel has value between -25 and 25, disarm if
	// channel ATTMODE value is less than -25
/*
	if (autopilot) {
		en = 1;
		speedpid = 0;

